Revit 2026 API

# IFCExtrusionBasis Enumeration

---

This enumerated type represents the possible bases for derivation of extrusion geometry.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCExtrusionBasis
```
```vb
Public Enumeration IFCExtrusionBasis
```
```cpp
public enum class IFCExtrusionBasis
```
```fsharp
type IFCExtrusionBasis
```

| Member name | Value | Description |
| --- | --- | --- |
| BasisX | 0 | The X direction. |
| BasisY | 1 | The Y direction. |
| BasisZ | 2 | The Z direction. |
| InvalidBasis | -1 | An invalid basis (typically indicating that the extrusion extraction was unsuccessful). |

#### Reference

Autodesk.Revit.DB.IFC Namespace